# Homebrew packages for macOS

# Core utilities
brew "stow"
brew "git"
brew "neovim"
brew "tmux"
brew "zsh"
brew "ripgrep"
brew "fzf"
brew "fd"
brew "bat"
brew "eza"
brew "tree"

# Development tools
brew "node"
brew "python"
brew "go"
brew "rust"
brew "docker"
brew "docker-compose"

# CLI tools
brew "jq"
brew "yq"
brew "httpie"
brew "gh"
brew "btop"

# Casks (GUI apps)
cask "visual-studio-code"
cask "obsidian"

# Fonts (from homebrew/cask)
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"